{
  "category": "development, javascript",
  "content": "<h2 id=\"why-the-double-standard-\">Why The Double Standard?</h2>\n<p>It&#39;s no secret that CoffeeScript is an extremely popular language for writing JavaScript. <a href=\"https://github.com/dropbox/dropbox-js\">Dropbox JS</a> is written nearly entirely in CoffeeScript. <a href=\"https://atom.io/\">Github&#39;s Atom</a> leverages it extensively. So do Airbnb, Basecamp, Cloudapp, and <a href=\"https://github.com/jashkenas/coffeescript/wiki/In-The-Wild\">many others</a>. CoffeeScript is highly compatible with popular JS frameworks like <a href=\"https://www.emberjs.com\">Ember</a>, <a href=\"https://www.underscorejs.org\">Underscore</a> and <a href=\"https://www.angularjs.org\">Angular</a>. Small wonder, that; CoffeeScript&#39;s lean syntax and convenient shortcuts allow you to accomplish more in less time, and that&#39;s something most people would consider to be a win.</p>\n<p>My colleagues at <a href=\"https://www.healthsparq.com\">HealthSparq</a> and myself all seem to be cut from a similar cloth, however, in that none of us has any interest in using CoffeeScript, and most of us actively dislike it. This isn&#39;t a coincidence; this is a team of hand-picked inviduals who were selected largely in part because their way of thinking already aligned closely with our existing methodologies. That isn&#39;t to say we&#39;re against using good tools for doing our work more efficiently, though. We are big fans of SCSS/SASS, and we are constantly evaluating new options for enhancing our workflow.</p>\n<p>A few weeks ago, one of our User Experience Designers asked the question in our frontend Slack group:</p>\n<blockquote>\n<p>&quot;So, why is okay for SASS to preprocess CSS but not ok for CoffeeScript to preprocess JS?&quot;</p>\n</blockquote>\n<p>This is a really good question. At first some trollish non-answers along the lines of &quot;Because reasons!&quot; were floated, but after taking a few minutes to consider the question (and pull from bits and pieces offered by my colleagues), I arrived at a more accurate way to articulate the reasoning behind our stance.</p>\n<h3 id=\"it-s-not-about-preprocessing\">It&#39;s Not About Preprocessing</h3>\n<p>Preprocessing is an advantage, sure, but that&#39;s not really all that CoffeeScript does. Preprocessing is merely a side effect of the fact that the CoffeeScript compiler has to translate its input into vanilla JavaScript. The issue is not necessarily about whether it&#39;s ok to preprocess with one thing and not with another. Technically speaking, our build system does some amount of &quot;preprocessing&quot; for us by concatenating and minifying our JavaScript and our compiled CSS.</p>\n<p>I like SCSS because it&#39;s a superset of existing CSS. It still requires that you have a full understanding of the CSS syntax and all of its properties in order to use it. Furthermore, it&#39;s not going to magically fix incompatibilities for you. It will give you tools (e.g. mixins) to make addressing things like vendor prefixing much easier, but you still have to know how to implement those things on their own in order to make use of SCSS&#39; conveniences.</p>\n<p>SCSS extends CSS and builds upon that foundation to give you a powerful set of tools to save yourself time, reduce redundancy in your code, and enable you to focus on what&#39;s important. It does all of this by being additive; it doesn&#39;t hide one thing behind another. You can drop standard CSS into an SCSS file and it will still build/validate without any issues.</p>\n<h3 id=\"obfuscation-is-bad\">Obfuscation is Bad</h3>\n<p>My main gripe with CoffeeScript is that it&#39;s not a superset or an extension of JavaScript. It is essentially it&#39;s own language; it&#39;s very smiliar to JavaScript, and it compiles to JavaScript, but it <em>is not</em> JavaScript; it obfuscates JavaScript behind its own set of conventions. Granted, it&#39;s arguably easier to work with (you certainly will write fewer lines of code), but it can be harder to understand what is actually going on, or what the implications of a given line of code could be.</p>\n<p>Ultimately, CoffeeScript is an abstraction of JavaScript; it utilizes similar (but different) syntax, and it alters the way that you write and think about your code. Moreover, CoffeeScript (not unlike jQuery) is something that newer developers can learn <em>instead of</em> learning proper JavaScript, and go on to write code with for years before ever touching vanilla JS. You don&#39;t necessarily need to know JavaScript to learn CoffeeScript, which means you could easily go for years lacking a fundamental understanding of what is actually happening in the code that you write.</p>\n<h3 id=\"what-does-this-even-say-how-did-this-get-here-i-am-not-good-with-computers\">What Does This Even Say How Did This Get Here I am Not Good With Computers</h3>\n<p>I would also argue that, like with HAML, readability of the code suffers. Yeah there&#39;s less code to wade through, and yes, anybody who knows the language can read it just fine, but I can&#39;t tell you how many times I&#39;ve found a solution to a code problem on Stack Overflow written in CoffeeScript instead of JavaScript, thus rendering it nearly useless to me. I shouldn&#39;t need to learn another language&#39;s syntax in order to translate documented solutions into something I can use; nor should I have to run that code through a compiler to get usable code out of it. This is simply bad practice; in this case, CoffeeScript becomes a <strong>dependency</strong> for implementing a solution, which makes little sense considering that JavaScript is universal.</p>\n<p>In the hands of seasoned JavaScript developers, CoffeeScript can be a useful tool. However, I worry that the degree to which CoffeeScript abstracts away the actual code being written is problematic, and it&#39;s potentially creating developers who don&#39;t know what&#39;s actually going on with the code they write. Even looking at the primary examples on CoffeeScript&#39;s homepage, I can see numerous potential gaps in understanding for a developer who never bothered to learn JavaScript proper:</p>\n<h4 id=\"example-1-inverse-pattern-for-logical-conditions\">Example 1: Inverse Pattern for Logical Conditions</h4>\n<p><strong>CoffeeScript</strong></p>\n<pre><code>number = -42 if opposite\n</code></pre><p><strong>Compiled JavaScript</strong></p>\n<pre><code>if (opposite) {\n\n  number = -42;\n}\n</code></pre><p>The order of operations for performing this logic check is switched around from what we&#39;re used to seeing in JavaScript; it&#39;s an entirely different pattern from the convention in JavaScript proper, and this could lead to confusion for somebody jumping straight in with CoffeeScript. I&#39;m curious why this can&#39;t be/isn&#39;t written as <code>if opposite number = -42</code>. That would follow the typical cause &gt; effect pattern we&#39;re used to seeing, not just in JavaScript, but many other languages.</p>\n<h4 id=\"example-2-truthiness-checking-more-inverse-patterns\">Example 2: Truthiness Checking, More Inverse Patterns</h4>\n<p><strong>CoffeeScript</strong></p>\n<pre><code>alert &quot;I knew it!&quot; if elvis?\n</code></pre><p><strong>Compiled JavaScript</strong></p>\n<pre><code>if (typeof elvis !== &quot;undefined&quot; &amp;&amp; elvis !== null) {\n\n  alert(&quot;I knew it!&quot;);\n}\n</code></pre><p>There are two things that really irk me here; the first is the shortcut on checking <code>elvis</code>&#39;s truthiness. Sure this is a whole 44 characters shorter, BUT if a developer is learning CoffeeScript and skipping a lot of JavaScript, they&#39;ll miss the fundamental concept of what&#39;s going with the truthiness check. Would this developer understand why we&#39;re looking for <code>&quot;undefined&quot;</code> rather than <code>undefined</code>, and what the difference between the two is? Do they understand why it&#39;s important to check for both <code>&quot;undefined&quot;</code> as well as <code>null</code>? Also, does this particular logic satisfy all of a given use case&#39;s conditions?</p>\n<p>Secondly, again, we see the inverse logical condition pattern, which is rapildy developing into something of a bad habit.</p>\n<h4 id=\"example-3-function-declarations-with-variable-argument-lengths\">Example 3: Function Declarations with Variable Argument Lengths</h4>\n<p><strong>CoffeeScript</strong></p>\n<pre><code>race = (winner, runners...) -&gt;\n  print winner, runners\n</code></pre><p><strong>Compiled JavaScript</strong></p>\n<pre><code>race = function() {\n\n  var runners, winner;\n  winner = arguments[0], runners = 2 &lt;= arguments.length ? slice.call(arguments, 1) : [];\n  return print(winner, runners);\n};\n</code></pre><p>CoffeeScript provides a feature called &quot;splats&quot;, represented by the ellipsis (<code>…</code>), which allow for denotation of optional arguments which may not always be present when a function is called. This is a nice convenience if you&#39;re used to dealing with the headache of reassigning argument values, but it would prevent a new developer from properly understanding how to handle this situation in JavaScript, and the importance of writing these checks in your code.</p>\n<h4 id=\"example-4-scoping-obfuscation\">Example 4: Scoping Obfuscation</h4>\n<p>Throughout the CoffeeScript examples, variables are <em>never</em> explicitly declared. Not once. With CoffeeScript, you are allowed to throw variables around at leisure, trusting the compiler to handle declaring them for you when you&#39;re done. Again, this is nice, but what happens when our hypothetical CoffeeScript-only dev has to make the move back to JavaScript? Will they understand that they need to explicitly declare their variables? Will they further understand the difference between <code>var foo = &#39;bar&#39;;</code> inside and outside of a block? Will they even know they should use <code>var</code> inside of blocks when reusing variable names if they want those variables to be discrete?</p>\n<h3 id=\"not-the-same-as-a-framework\">Not the Same as a Framework</h3>\n<p>One could easily make counter points to many of my arguments.</p>\n<p><strong>&quot;Well what about Ember and Handlebars? You have to <em>learn</em> those too!&quot;</strong></p>\n<p>Ember is not an abstraction language; it is a robust framework with an API built strictly on JavaScript. It does some really great things for you, but you need to know JavaScript proper to really do much with it beyond the basic implementations, let alone actually understand Ember itself. It doesn&#39;t allow you to shortcut your JavaScript knowledge; if anything, it relies on it, and it will help you build that knowledge over time.</p>\n<p><strong>&quot;Nobody would actually learn CoffeeScript without learning JavaScript!&quot;</strong></p>\n<p>This is, in my mind, a poor argument. Some people <em>absolutely would</em> skip over JavaScript straight to CoffeeScript. I see it all the time with back-end developers looking to jump into JavaScript, either to accomplish a task quickly or to not have to deal with learning all of JavaScript&#39;s ins and outs. I will be one of the first to admit to (and agree with) the fact that JavaScript has many quirks and idiosyncracies that can trip you up if you&#39;re not careful. That doesn&#39;t mean you shouldn&#39;t be aware of them, though; knowing what can bite you if you&#39;re not careful can save you loads of headache down the road, and it can come in very handy when troubleshooting your code, or somebody else&#39;s!</p>\n<p>Furthermore, this has already been happening with jQuery for a very long time; jQuery is essentially a gateway into JavaScript for a lot of web developers. Hell, that&#39;s how I got started, and while it was a nice, accessible way to get off the ground quickly, the knowledge gap that created for me took a good while to overcome. Note that jQuery still uses standard JavaScript syntax, so at least it&#39;s teaching you to write your code correctly(ish) even if you don&#39;t know what&#39;s actually happening under the hood!</p>\n<p><strong>&quot;Javascript is just an abstraction of machine code that has to go through it&#39;s own compiler!&quot;</strong></p>\n<p>Trolls are really obnoxious, aren&#39;t they?</p>\n<h2 id=\"lesser-of-two-evils\">Lesser of Two Evils</h2>\n<p>JavaScript gets a ton of flak in the larger development community, sometimes deservedly so. It&#39;s full of idiosyncracies you won&#39;t find in most &quot;proper&quot; languages, and the fact that so much work is going on in the JS community to make it behave less like a scripting language is very telling. That being said, I still think it can be extremely powerful, and the past few years have demonstrated that not only is it immensely capable, but that it&#39;s potential is growing rapidly. All of that capability doesn&#39;t come for free, though. The only way to manage those idiosyncracies gracefully is to gain experience with the language as it was intended.</p>\n<p>But hey, what do I know? CoffeeScript has been around since 2010 and is only growing in popularity. I could just be a grump who&#39;s ignoring something that&#39;s very cool and potentially extremely useful. Then again, maybe there&#39;s a good reason modern framework documentation isn&#39;t written in CoffeeScript.</p>\n<h2 id=\"finale\">FINALE</h2>\n<p>The path to making JavaScript more elegant isn&#39;t through layers of abstraction. It&#39;s through gradual refinement of the language (<a href=\"https://github.com/tc39\">TC39</a>), and smart implementations like Ember that bring familiar patterns from other languages into the JavaScript world, while working within the constraints of what the language can already achieve in the meantime.</p>\n<h4 id=\"extended-reading\">Extended Reading</h4>\n<ul>\n<li><a href=\"http://developer.telerik.com/featured/the-rise-of-typescript/\">The Rise of TypeScript</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Mozilla/Projects/Rhino/JavaScript_Compiler\">Rhino JavaScript Compiler</a></li>\n</ul>\n",
  "created": "5/7/2015",
  "excerpt": "<p>Tersely formatted pseudolanguages are convenient, but they can be potentially harmful to the ecosystem at large.</p>\n",
  "title": "The Hazards of JavaScript Preprocessors",
  "updated": "5/8/2015",
  "id": "hazards-of-javascript-preprocessors",
  "createdTime": "3:58pm",
  "updatedTime": null,
  "tags": null,
  "headerImage": "http://f.cl.ly/items/2u2R0S1R0C320B1I3O0X/stupid-coffeescript-header.jpg"
}
